[Language]
Main_Title=Terima kasih kerana memilih EaseUS Data Recovery Wizard!
Sub_Title=Bagaimana anda menilai keseluruhan pengalaman anda?
Terrible=Dahsyat
Poor=Buruk
Good=Baik
Great=Hebat
Excellent=Cemerlang
Never_Ask_Again=Jangan Bertanya Lagi
Rate_Now=Nilai sekarang
Feedback_Text_Tips=Sila tinggalkan maklum balas anda di sini.
Feedback_Length_Tips=Anda telah memasukkan lebih daripada 500 huruf. Sila hantarkan lebih banyak maklum balas ke support@easeus.com
